#+TITLE: Intro To Comp Thinking Week 8 Tutorial
#+AUTHOR: Hankertrix
#+STARTUP: showeverything
#+OPTIONS: toc:2

* Question 5
#+begin_src python :results output
number = 50
def Func(number):
    print(number)
    number=2
    print(number)

Func(number)
print(number)
#+end_src

#+RESULTS:
: 50
: 2
: 50

* Question 6
#+begin_src python :results output
confusing = 0
def do_work(num):
    confusing = -50
    confusing += num
    print("confusing in do_work is ", confusing)
    return confusing

confusing = 100
print("confusing in main is ", confusing)
confusing += do_work(confusing)
print("confusing in main is ", confusing)
confusing += do_work(confusing)
print("confusing in main is ", confusing)
confusing += do_work(confusing)
#+end_src

#+RESULTS:
: confusing in main is  100
: confusing in do_work is  50
: confusing in main is  150
: confusing in do_work is  100
: confusing in main is  250
: confusing in do_work is  200


